docs/src/architecture/08_concepts/signed_doc/docs/election_parameters.md
```d2 layout="elk"
"Election Parameters": {
  shape: sql_table
  "content type": application/json
  "type [0]": 788ff4c6-d65a-451f-bb33-575fe056b411
  "id": UUIDv7
  "ver": UUIDv7
  "brand_id": Brand Parameters
  "campaign_id": Campaign Parameters
  "category_id": Category Parameters

}

"Election Parameters"."brand_id"->"Brand Parameters"
"Election Parameters"."campaign_id"->"Campaign Parameters"
"Election Parameters"."category_id"->"Category Parameters"
```
